import React from 'react';

const AgreementContent = () => (
    <div>
        <h2 className="content-title">Согласие на сбор и обработку данных</h2>
        <p>СОГЛАСИЕ на сбор и обработку персональных данных</p>

        <p>В соответствии с Законом РК «О персональных данных и их защите» от 21 мая 2013 года и иными законодательными актами РК (далее совместно именуются как «Закон»), я, ___________________________ (Ф.И.О.) [являясь законным представителем/ представляя интересы по доверенности]: ___________________________ (Ф.И.О.), именуемого далее как «Субъект данных», настоящим предоставляю компании ТОО "Жеті Аспан Сервис" (далее - Оператору) безусловное согласие на сбор и обработку [моих (обо мне)] персональных данных (Субъекта данных), то есть всех сведений, относящихся [ко мне] [к Субъекту данных] и зафиксированных на электронном, бумажном и/или ином материальном носителе, которые будут или стали известны Оператору в процессе его деятельности и/или в рамках гражданско-правовых или иных отношений между [мной] [Субъектом данных] и Оператором.</p>

        <p>Оператор вправе осуществлять сбор и обработку персональных данных, только в рамках и в соответствии с Законом и/или всеми и любыми договорами, заключенными/заключаемыми между [мной] [Субъектом данных] и Оператором. При этом, мне известно, что согласно Закону [я, Субъект] не вправе отозвать настоящее Согласие в случаях, если этот отзыв будет противоречить Закону, либо при наличии неисполненных [мной] [Субъектом] обязательств перед Оператором. Настоящим подтверждаю, что каких-либо претензий к Оператору касательно сбора и обработки персональных данных в дальнейшем иметь не буду, при условии соблюдения Оператором требований Закона и/или наших договорённостей.</p>
    </div>
);

export default AgreementContent;