import React from 'react';

const CookiesContent = () => (
    <div>
        <h2 className="content-title">Информация об использовании cookies</h2>

        <h3>ОБЩИЕ ПОЛОЖЕНИЯ ОБ ИСПОЛЬЗОВАНИИ COOKIE-ФАЙЛОВ</h3>
        <p>Cookie-файл – небольшой текстовый файл, который направляется веб-сервером и сохраняется на компьютере, мобильном телефоне или любом другом устройстве, имеющем доступ в сеть Интернет, при посещении Приложений и сайтов. Файлы cookie запоминают информацию о Ваших предпочтениях и позволяют Вам просматривать посещенные сайты по истечении определенного времени в более удобном режиме. Данная информация позволяет нам улучшить качество сервиса при посещении Вами нашего Приложения, получить аналитическую информацию, повысить эффективность работы нашего Приложения. При использовании файлов cookie конфиденциальность пользователя не нарушается. Файлы cookie не используются для установления личности пользователя (за исключением, если персональные данные пользователя не были им добровольно направлены посредством обратной связи в соответствии с Политикой сбора и обработки персональных данных, размещенной в сети Интернет по адресу: для целей настоящего Соглашения, файл cookie применяется также любые другие схожие технологии).</p>

        <h3>ВИДЫ COOKIE-ФАЙЛОВ</h3>
        <ul>
            <li>Аутентификационные cookie-файлы: используются для сохранения сведений об учетной записи пользователя, а также информации, необходимой для доступа к Приложению.</li>
            <li>Аналитические cookie-файлы, веб-маяки, теги действия и др.</li>
        </ul>
    </div>
);

export default CookiesContent;