import React from 'react';

const OfertaContent = () => (
    <div>
        <h2 className="content-title">Публичная оферта</h2>

        <h3>1. Общие положения</h3>
        <p>1.1. Внимательно ознакомьтесь с текстом публичной оферты, и если Вы не согласны с каким-либо пунктом оферты, Вам предлагается отказаться от покупки Товаров или использования Услуг, предоставляемых Продавцом. </p>
        <p>1.2. В соответствии со статьей 395 Гражданского Кодекса Республики Казахстан (далее – ГК РК) данный документ является публичной офертой, и в случае принятия изложенных ниже условий физическое лицо, производящее акцепт этой оферты, осуществляет оплату Товара Продавца в соответствии с условиями настоящего Договора. В соответствии с пунктом 3 статьи 396 ГК РК, оплата Товара Покупателем является акцептом оферты, что считается равносильным заключению Договора на условиях, изложенных в оферте. </p>
        <p>1.3. В настоящей оферте, если контекст не требует иного, нижеприведенные термины имеют следующие значения:</p>
        <ul>
            <li>«Оферта» — публичное предложение Продавца, адресованное любому физическому/юридическому лицу, заключить с ним договор купли-продажи (далее — «Договор») на существующих условиях, содержащихся в Договоре, включая все его приложения.</li>
            <li>«Продавец» — компания, реализующая Товар, представленный на интернет-сайте www.galmart.kz.</li>
            <li>«Покупатель» — физическое или юридическое лицо, заключившее с Продавцом Договор на условиях, содержащихся в Договоре.</li>
            <li>«Акцепт» — полное и безоговорочное принятие Покупателем условий Договора.</li>
            <li>«Товар» — перечень наименований ассортимента, представленный на интернет-сайте www.galmart.kz.</li>
            <li>«Заказ» — отдельные позиции из ассортиментного перечня Товара, указанные Покупателем при размещении заявки на интернет-сайте www.galmart.kz.</li>
            <li>«Сайт» – совокупность электронных документов (файлов) Продавца, доступных в сети Интернет по адресу www.galmart.kz.</li>
        </ul>

        <h3>2. Предмет договора</h3>
        <p>2.1. Продавец продает Товар в соответствии с действующим прейскурантом, опубликованным на интернет-сайте Продавца, а Покупатель производит оплату и принимает Товар в соответствии с условиями настоящего Договора.</p>
        <p>2.2. Настоящий Договор и все приложения к нему являются официальными документами Продавца и неотъемлемой частью Оферты.</p>

        <h3>3. Размещение Заказа</h3>
        <p>3.1. Заказ Товара осуществляется Покупателем через Сайт или посредством телефонной связи с диспетчерской службой указанных на Сайте.</p>
        <p>3.2. При регистрации (размещении) Заказа на Сайте Продавца, Покупатель обязуется предоставить регистрационную информацию о себе.</p>
        <p>3.3. Принятие Покупателем условий настоящего Договора осуществляется посредством внесения Покупателем соответствующих данных в регистрационную форму на интернет-сайте. Покупатель имеет право редактировать регистрационную информацию о себе. Продавец обязуется не сообщать регистрационные данные Покупателя, указанные на Сайте, а также иную информацию, касающуюся личных данных Покупателя, лицам, не имеющим отношения к исполнению Заказа. Утвердив Заказ выбранного Товара, Покупатель предоставляет необходимую информацию для доставки товара.</p>
        <p>3.4. Покупатель несет ответственность за содержание и достоверность информации, предоставленной при размещении Заказа.</p>
        <p>3.5. Все информационные материалы, представленные на Сайте, носят справочный характер и не могут в полной мере передавать достоверную информацию об определенных свойствах и характеристиках Товара, таких как: цена, цвет, форма, размер и упаковка. В случае возникновения у Покупателя вопросов, касающихся свойств и характеристик Товара, перед размещением Заказа ему необходимо обратиться за консультацией или послать запрос на адрес электронной почты.</p>
        <p>3.6. При получении заказа Покупатель проверяет товары на целостность, качество и соответствие доставленного товара с товаром выбранном на сайте. В противном случае, возврат товара Покупатель осуществляет в торговый зал супермаркета.</p>

        <h3>4. Сроки исполнения Заказа</h3>
        <p>4.1. Срок, в который Продавец обязуется исполнить Заказ, составляет от одного рабочего дня. Срок исполнения Заказа зависит от наличия заказанных позиций Товара на складе Продавца и времени, необходимого на обработку Заказа. Срок исполнения Заказа в исключительных случаях может быть оговорен с Покупателем индивидуально в зависимости от характеристик и количества заказанного Товара. В случае отсутствия части Заказа на складе Продавца, в том числе по причинам, не зависящим от последнего, Продавец вправе аннулировать указанный Товар из Заказа Покупателя. Продавец обязуется уведомить Покупателя об изменении комплектности его Заказа путем направления сообщения на электронный адрес, указанный при регистрации на Сайте, или дополнительным письменным пояснением на товарном чеке при непосредственном получении Заказа Покупателем.</p>
        <p>4.2. Заказ считается исполненным в момент его передачи Покупателю. Расписываясь в товарной накладной предоставляемой курьером курьерской службы Продавца, Покупатель подтверждает исполнение Заказа.</p>
        <p>4.3. Стоимость и условия доставки Заказа Покупатель уточняет на Сайте Продавца. </p>
        <p>4.4. В случае предоставления Покупателем недостоверной информации об его контактных данных или составе Заказа, Продавец за ненадлежащее исполнение Заказа ответственности не несет. </p>

        <h3>5. Оплата Заказа </h3>
        <p>5.1. Оплата исполненного Заказа осуществляется: </p>
        <ol>
            <li>путем перечисления денежных средств на расчетный счет Продавца; </li>
            <li>путем перечисления Покупателем денежных средств в режиме онлайн через систему электронных платежей следующими платежными средствами: • кредитные карты (VISA, MasterCard) через epay Halyk bank; • прямой банковский перевод (для юридических лиц) </li>
        </ol>
        <p>5.2. В случае, если при совершении Покупки на сайте или мобильном приложении galmart, на банковской карте Покупателя недостаточно денежных средств, супермаркет вправе удержать недостающую сумму из бонусного счета Покупателя в безакцептном порядке. </p>
        <p>5.3. Цена на каждую позицию Товара отображается на Сайте. В случае изменения цены на заказанные позиции Товара, Продавец обязуется в кратчайшие сроки проинформировать Покупателя о таком изменении. Покупатель вправе подтвердить либо аннулировать Заказ. В случае отсутствия связи с Покупателем Заказ считается аннулированным в течение 14 (четырнадцати) календарных дней с момента размещения.</p>
        <p>5.4. Цены на любые позиции Товара, указанные на Сайте, могут быть изменены Продавцом в одностороннем порядке без уведомления Покупателя. </p>
        <p>5.5. Оплата Покупателем самостоятельно размещенного Заказа на Сайте означает согласие с Условиями настоящего Договора. День оплаты Заказа является датой заключения Договора оферты между Продавцом и Покупателем.  </p>

        <h3>6. Возврат Заказа </h3>
        <p>6.1. В течение четырнадцати дней с момента передачи товара, Покупатель вправе обменять купленный товар на аналогичный товар другого размера, формы, габарита, фасона, расцветки, комплектации и т.п., произведя, в случае разницы в цене, необходимый перерасчет с продавцом. При этом все товары, надлежащие обмену или возврату клиент должен самостоятельно принести в торговый зал с чеком. Обмен или возврат будут осуществляться согласно внутренних правил в присутствии сотрудника СВК (служба внутреннего контроля), в точности, как если бы товар был приобретен клиентом собственноручно в торговом зале. </p>
        <p>6.2. В случае доставки Продавцом Товара ненадлежащего качества, Покупатель обязуется предоставить Товар Продавцу в порядке и на условиях предусмотренным в Сайте Продавца, в максимально короткие сроки с момента покупки для осуществления проверки качества Товара. </p>
        <p>6.3. Право собственности на Заказ, а также риск его повреждения переходят к Покупателю с момента передачи Товара Покупателю. </p>
        <p>6.4. В соответствии с п. 1 ст. 14 ЗРК от 4 мая 2010 года № 274-IV «О защите прав потребителей», Покупатель вправе в течение четырнадцати дней с момента передачи ему непродовольственного товара, если более длительный срок не объявлен продавцом (изготовителем), обменять купленный товар в месте покупки или иных местах, объявленных продавцом (изготовителем), на аналогичный товар другого размера, формы, габарита, фасона, расцветки, комплектации и тому подобное либо на другой товар по соглашению сторон, произведя в случае разницы в цене необходимый перерасчет с продавцом. </p>
        <p>6.5. В соответствии со ст. 30 ЗРК от 4 мая 2010 года № 274-IV «О защите прав потребителей», Продавец (изготовитель) обязан обеспечить обмен или возврат непродовольственного товара надлежащего качества, если он не был в употреблении, сохранены его товарный вид, потребительские свойства, пломбы, ярлыки, а также документ, подтверждающий факт приобретения товара, в течение четырнадцати календарных дней, если более длительный срок не установлен договором, со дня приобретения товара, за исключением:</p>
        <ol>
            <li>лекарственных средств и медицинских изделий; </li>
            <li>нательного белья; </li>
            <li>чулочно-носочных изделий; </li>
            <li>животных и растений; </li>
            <li>метражных товаров, а именно тканей из волокон всех видов, трикотажного и гардинного полотна, меха искусственного, ковровых изделий, нетканых материалов, лент, кружева, тесьмы, проводов, шнуров, кабелей, линолеума, багета, пленки, клеенки; </li>
            <li>абонентского устройства сотовой связи. В случае если документ, подтверждающий факт приобретения товара, был утерян или по каким-либо причинам не выдан потребителю, то обмен или возврат товара должен быть произведен, если потребитель докажет факт покупки у данного продавца (изготовителя).  </li>
        </ol>

        <h3>7. Прочие условия </h3>
        <p>7.1. Настоящим Покупатель соглашается с обязательными условиями настоящего Договора публичной оферты. </p>
        <p>7.2. В соответствии с условиями настоящего Договора публичной оферты Продавец имеет право отказать в размещении Заказа лицам, выражающим несогласие с условиями настоящего Договора. </p>
        <p>7.3. Продавец оставляет за собой право вносить изменения в настоящее Соглашение, в связи, с чем Покупатель обязуется регулярно отслеживать изменения в Соглашении, опубликованном на сайте www.galmart.kz.</p>
    </div>
);

export default OfertaContent;