import React from 'react';

const PrivacyContent = () => (
    <div>
        <h2 className="content-title">Политика конфиденциальности</h2>

        <h3>1. Общие положения</h3>
        <p>Настоящая политика обработки персональных данных составлена в соответствии с требованиями Закона «О персональных данных и их защите» (далее - Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые командой galmart при приеме денег от клиента за услуги по покупке и доставке товара (далее – Оператор). </p>
        <p>1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных. </p>
        <p>1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях приложения. </p>

        <h3>2. Основные понятия, используемые в Политике </h3>
        <p>2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники. </p>
        <p>2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных). </p>
        <p>2.3. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств. </p>
        <p>2.4. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных. </p>
        <p>2.5. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными. </p>
        <p>2.6. Оператор –юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными. </p>
        <p>2.7. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю приложения. </p>
        <p>2.8. Персональные данные, разрешенные субъектом персональных данных для распространения, - персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных. </p>
        <p>2.9. Пользователь – любой посетитель приложения. </p>
        <p>2.10. Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.</p>

        <h3>3. Основные права и обязанности Оператора </h3>
        <p>3.1. Оператор имеет право: </p>
        <ul>
            <li>– получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные; </li>
            <li>– в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных;</li>
        </ul>
        <p>3.2. Оператор обязан: </p>
        <ul>
            <li>– предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных; </li>
            <li>– организовывать обработку персональных данных в порядке, установленном действующим законодательством РК; </li>
            <li>– отвечать на обращения и запросы субъектов персональных данных и их законных представителей в соответствии с требованиями Закона о персональных данных; </li>
            <li>– сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 30 дней с даты получения такого запроса;</li>
            <li>– принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных; </li>
            <li>– прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных; </li>
            <li>– исполнять иные обязанности, предусмотренные Законом о персональных данных. </li>
        </ul>

        <h3>4. Основные права и обязанности субъектов персональных данных </h3>
        <p>4.1. Субъекты персональных данных имеют право: </p>
        <ul>
            <li>– получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных законами; </li>
            <li>– выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг; </li>
            <li>– на отзыв согласия на обработку персональных данных; </li>
            <li>– обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных; </li>
            <li>– на осуществление иных прав, предусмотренных законодательством РК. </li>
        </ul>
        <p>4.2. Субъекты персональных данных обязаны: </p>
        <ul>
            <li>– предоставлять Оператору достоверные данные о себе; </li>
            <li>– сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных. Субъект самостоятельно вносит изменения в своем личном кабинете. </li>
        </ul>
        <p>4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РК.</p>

        <h3>5. Оператор может обрабатывать следующие персональные данные Пользователя </h3>
        <p>5.1. Фамилия, имя, отчество. </p>
        <p>5.2. Электронный адрес. </p>
        <p>5.3. Номера телефонов. </p>
        <p>5.4. Также на сайте происходит сбор и обработка обезличенных данных о посетителях. </p>
        <p>5.5. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.</p>
        <p>5.7. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, интимной жизни, Оператором не осуществляется. </p>

        <h3>6. Принципы обработки персональных данных </h3>
        <p>6.1. Обработка персональных данных осуществляется на законной и справедливой основе. </p>
        <p>6.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных. </p>
        <p>6.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой. </p>
        <p>6.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки. </p>

        <h3>7. Цели обработки персональных данных</h3>
        <p>7.1. Цель обработки персональных данных Пользователя: </p>
        <ul>
            <li>– информирование Пользователя посредством отправки электронных писем; </li>
            <li>– заключение, исполнение и прекращение гражданско-правовых договоров; </li>
            <li>– предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся в приложении </li>
        </ul>
        <p>7.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. </p>

        <h3>8. Правовые основания обработки персональных данных</h3>
        <p>8.1. Правовыми основаниями обработки персональных данных Оператором являются:</p>
        <ul>
            <li>– Закон о Защите персональных данных; </li>
            <li>– уставные документы Оператора; </li>
            <li>– договоры, заключаемые между оператором и субъектом персональных данных; </li>
            <li>– законы, иные нормативно-правовые акты в сфере защиты персональных данных; </li>
            <li>– согласие Пользователей на обработку их персональных данных, на обработку персональных данных, разрешенных для распространения.</li>
        </ul>
        <p>8.2. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные в приложении или направленные Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой. </p>

        <h3>9. Условия обработки персональных данных </h3>
        <p>9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных. </p>
        <p>9.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором Республики Казахстан или законом, для осуществления возложенных законодательством РК на оператора функций, полномочий и обязанностей. </p>
        <p>9.3. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем, по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем.</p>

        <h3>10. Конфиденциальность персональных данных </h3>
        <p>10.1 Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено законом. </p>

        <h3>11. Заключительные положения </h3>
        <p>11.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающиеся обработки его персональных данных, обратившись к Оператору с помощью обращения в личный кабинет или по адресу: г. Астана, ул.Сарайшык 32/2.</p>
    </div>
);

export default PrivacyContent;