import React from 'react';

const ReturnsContent = () => (
    <div>
        <h2 className="content-title">Правила возврата и обмена</h2>

        <h3>1. Обмен и возврат товаров надлежащего качества</h3>
        <p>Покупатель вправе в течение четырнадцати дней с момента передачи товара, Покупатель вправе обменять купленный товар на аналогичный товар другого размера, формы, габарита, фасона, расцветки, комплектации и т.п. товара, или возвратить продавцу с необходимым перерасчетом с продавцом.</p>

        <h3>2. Возврат товаров ненадлежащего качества</h3>
        <p>В случае обнаружения Продавцом товара ненадлежащего качества, Покупатель обязуется предоставить Товар Продавцу в порядке и на условиях предусмотренным в Сайте Продавца, в максимально короткие сроки с момента покупки для осуществления проверки качества Товара.</p>

        <h3>ПЕРЕЧЕНЬ НЕПРОДОВОЛЬСТВЕННЫХ ТОВАРОВ, НЕ ПОДЛЕЖАЩИХ ОБМЕНУ И ВОЗВРАТУ:</h3>
        <p>В соответствии со ст. 30 ЗРК от 4 мая 2010 года № 274-IV «О защите прав потребителей», Продавец (изготовитель) обязан обеспечить обмен или возврат непродовольственного товара надлежащего качества, если он не был в употреблении, сохранены его товарный вид, потребительские свойства, пломбы, ярлыки, а также документ, подтверждающий факт приобретения товара, в течение четырнадцати календарных дней, если более длительный срок не установлен договором, со дня приобретения товара, за исключением:</p>
        <ol>
            <li>лекарственных средств и медицинских изделий;</li>
            <li>нательного белья;</li>
            <li>чулочно-носочных изделий;</li>
            <li>животных и растений;</li>
            <li>метражных товаров, а именно тканей из волокон всех видов, трикотажного и гардинного полотна, меха искусственного, ковровых изделий, нетканых материалов, лент, кружева, тесьмы, проводов, шнуров, кабелей, линолеума, багета, пленки, клеенок;</li>
            <li>абонентского устройства сотовой связи.</li>
        </ol>
    </div>
);

export default ReturnsContent;